Autodesk.Revit.DB.Architecture.StairsType.MiddleSupportType
The type of middle supports used in the stair.
invalidElementId if the stairs type has no middle support.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: supportType is not a valid support type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The stairs type has no middle support so the data being set is not applicable.
Since:
2013